In [1]:
# importando a biblioteca Pandas
import pandas as pd

In [16]:
# lendo um arquivo CSV
df = pd.read_csv('meu_arquivo.csv', encoding = 'latin1', sep = ';')

In [17]:
df

    Nome  Idade       Sexo
0   João     21  Masculino
1  Maria     18   Feminino
2  Pedro     34  Masculino
3  Joana     25   Feminino

In [18]:
# lendo um arquivo Excel
df = pd.read_excel('meu_arquivo.xlsx')

In [19]:
df

    Nome  Idade       Sexo
0   João     21  Masculino
1  Maria     18   Feminino
2  Pedro     34  Masculino
3  Joana     25   Feminino

In [20]:
# Lendo arquivos HTML
tabela_wiki = pd.read_html('https://en.wikipedia.org/wiki/Minnesota')

In [23]:
print(f'Total de tabelas {len(tabela_wiki)}')

Total de tabelas 31

In [27]:
tabela_wiki_temperatura = pd.read_html('https://en.wikipedia.org/wiki/Minnesota', match='Average daily maximum and minimum temperatures for selected cities in Minnesota')

In [29]:
tabela_wiki_temperatura[0]

              Location July (°F) July (°C) January (°F) January (°C)
0          Minneapolis     83/64     28/18         23/7       −4/−13
1           Saint Paul     83/63     28/17         23/6       −5/−14
2            Rochester     82/63     28/17         23/3       −5/−16
3               Duluth     76/55     24/13         19/1       −7/−17
4            St. Cloud     81/58     27/14        18/−1       −7/−18
5              Mankato     86/62     30/16         23/3       −5/−16
6  International Falls     77/52     25/11        15/−6       −9/−21

In [34]:
#Criando um DataFrame a partir de uma lista

# criando uma lista de dados
dados = [[1, 'João', 'São Paulo'], [2, 'Maria', 'Rio de Janeiro'], [3, 'José', 'Belo Horizonte']]

# criando um DataFrame a partir da lista
df = pd.DataFrame(dados, columns=['id', 'nome', 'cidade'])


df

   id   nome          cidade
0   1   João       São Paulo
1   2  Maria  Rio de Janeiro
2   3   José  Belo Horizonte

In [35]:
#Criando um DataFrame a partir de um dicionário:

# criando um dicionário de dados
dados = {'id': [1, 2, 3], 'nome': ['João', 'Maria', 'José'], 'cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte']}

# criando um DataFrame a partir do dicionário
df = pd.DataFrame(dados)

df.head()

   id   nome          cidade
0   1   João       São Paulo
1   2  Maria  Rio de Janeiro
2   3   José  Belo Horizonte

In [36]:
#Criando um DataFrame a partir de uma lista de dicionários:

# criando uma lista de dicionários
dados = [{'id': 1, 'nome': 'João', 'cidade': 'São Paulo'}, {'id': 2, 'nome': 'Maria', 'cidade': 'Rio de Janeiro'}, {'id': 3, 'nome': 'José', 'cidade': 'Belo Horizonte'}]

# criando um DataFrame a partir da lista de dicionários
df = pd.DataFrame(dados)


df.head()

   id   nome          cidade
0   1   João       São Paulo
1   2  Maria  Rio de Janeiro
2   3   José  Belo Horizonte

In [37]:
# escrevendo um DataFrame em um arquivo CSV
df.to_csv('novo_arquivo_1.csv', index=False, encoding = 'latin1')

# escrevendo um DataFrame em um arquivo Excel
df.to_excel('novo_arquivo_1.xlsx', index=False, encoding = 'latin1')

E:\Programas\Conda\lib\site-packages\pandas\util\_decorators.py:211: FutureWarning: the 'encoding' keyword is deprecated and will be removed in a future version. Please take steps to stop the use of 'encoding'
  return func(*args, **kwargs)
<ipython-input-37-c3b1f96d2505>:5: UserWarning: Pandas requires version '1.4.3' or newer of 'xlsxwriter' (version '1.3.7' currently installed).
  df.to_excel('novo_arquivo_1.xlsx', index=False, encoding = 'latin1')